<!--
 * @Author: ${git_name}
 * @Date: 2025-05-09 13:55:35
 * @LastEditors: ${git_name}
 * @LastEditTime: 2025-05-20 18:24:13
 * @FilePath: /books/web/src/views/standards/products/vabAutoComponents/ProductsDetailFormulasHardnessToStrength.vue
 * @Description: 
 * 一花一世界，一叶一如来
 * Copyright (c) 2025 by 杭州大美, All Rights Reserved. 
-->
<template>
  <vab-card>
    <template #header>
      <div class="card-header">
        <div>{{ currentFormula.name }}</div>
        <el-icon @click="closeFormula">
          <close />
        </el-icon>
      </div>
    </template>
    <el-tabs class="demo-tabs">
      <el-tab-pane label="强度对照">
        <el-form class="demo-form-inline" :inline="true">
          <el-alert :closable="false" show-icon type="info">
            <p>根据已知强度查询硬度对照值</p>
          </el-alert>
          <el-form-item label="选择">
            <el-select v-model="formulasForm.intensity" placeholder="" style="width: 160px" @change="changeIntensity">
              <template #prefix>强度</template>
              <el-option v-for="item in state.intensity" :key="`intensity[${item}]`" :label="item" :value="item" />
            </el-select>
          </el-form-item>
          <el-form-item label="数值">
            <el-autocomplete
              v-model="formulasForm.intensityVal"
              class="inline-input w-50"
              clearable
              :fetch-suggestions="querySearchIntensity"
              placeholder=""
              :trigger-on-focus="!!formulasForm.intensity"
              @select="handleIntensity"
            />
          </el-form-item>
        </el-form>
      </el-tab-pane>
      <el-tab-pane label="硬度对照">
        <el-form class="demo-form-inline" :inline="true">
          <el-alert :closable="false" show-icon type="info">
            <p>根据已知硬度查询强度对照值</p>
          </el-alert>
          <el-form-item label="选择">
            <el-select v-model="formulasForm.hardness" placeholder="" style="width: 160px" @change="changeHardness">
              <template #prefix>硬度</template>
              <el-option v-for="item in state.hardness" :key="`hardness[${item}]`" :label="item" :value="item" />
            </el-select>
          </el-form-item>
          <el-form-item label="数值">
            <el-autocomplete
              v-model="formulasForm.hardnessVal"
              class="inline-input w-50"
              clearable
              :fetch-suggestions="querySearchHardness"
              placeholder=""
              :trigger-on-focus="!!formulasForm.hardness"
              @select="handleHardness"
            />
          </el-form-item>
        </el-form>
      </el-tab-pane>
    </el-tabs>
    <div v-if="Object.keys(result).length">
      <el-divider content-position="left">强度值</el-divider>
      <el-space wrap>
        <!-- 强度值 -->
        <span v-for="(item, index) in filteredRelation('intensity')" :key="`resultIntensity[${index}]`">
          <el-card
            v-if="item.type == 'intensity' && result[index]"
            class="box-card"
            :header-class="`${['碳钢', '不锈钢', '铬钢', '铬钼钢'].includes(index) ? 'intensity-focal-header' : 'intensity-header'}`"
            style="width: 125px"
          >
            <template #header>
              <div class="card-header">
                <el-text type="primary">{{ item['name'] }}</el-text>
              </div>
            </template>
            <p style="text-align: center">
              <el-text size="large" type="primary">{{ result[index] }}</el-text>
            </p>
            <p style="text-align: center">
              <el-text type="info">{{ item['unit'] }}</el-text>
            </p>
            <template #footer>
              <el-switch
                v-model="item['unit']"
                active-text="MPa"
                active-value="MPa"
                inactive-text="ksi"
                inactive-value="ksi"
                inline-prompt
                style="--el-switch-on-color: var(--default-color); --el-switch-off-color: #828282; height: 30px"
                width="80"
                @change="(value) => changeUnit(value, index)"
              />
            </template>
          </el-card>
        </span>
      </el-space>
      <el-divider content-position="left">硬度值</el-divider>
      <el-space wrap>
        <!-- 硬度值 -->
        <span v-for="(item, index) in filteredRelation('hardness')" :key="`resultIntensity[${index}]`">
          <el-card
            v-if="item.type == 'hardness' && result[index]"
            class="box-card"
            :header-class="`${['洛氏HRC', '洛氏HRB', '维氏HV', '布氏HBS', '布氏HBW'].includes(index) ? 'hardness-focal-header' : 'hardness-header'}`"
            style="width: 125px"
          >
            <template #header>
              <div class="card-header">
                <el-text type="primary">{{ item['name'] }}</el-text>
                <el-text>{{ item['condition'] }}</el-text>
              </div>
            </template>
            <p style="text-align: center">
              <el-text size="large" type="primary">{{ formatNumber(result[index]) }}</el-text>
            </p>
            <p style="text-align: center">
              <el-text type="info">{{ item['unit'] }}</el-text>
            </p>
            <!-- <template #footer></template> -->
          </el-card>
        </span>
      </el-space>
    </div>
  </vab-card>
</template>

<script setup lang="ts">
import { useAclStore } from '/@/store/modules/acl'
import { DocumentCopy, Close } from '@element-plus/icons-vue'
import { getMathEvaluate, formatNumber } from '/@/utils/evaluateCondition'
import clip from '/@/utils/clipboard'

/* 权限和语言相关状态 */
const aclStore = useAclStore()
const { tolerance, intensity, material } = storeToRefs(aclStore) // 解构多语言列表响应式引用

/* 事件和全局方法 */
const emit = defineEmits(['close']) // 定义组件事件
// 定义 props 类型
const props = defineProps(['currentFormula', 'productRow', 'queryForm', 'formulas'])

interface RelationItem {
  name: string
  unit: string
  condition?: string
  type?: 'intensity' | 'hardness'
}

/* 核心响应式状态 */
const state = reactive<{
  loading: boolean
  submit: boolean
  intensity: string[]
  intensityVal: string[]
  hardness: string[]
  hardnessVal: string[]
  relation: Record<string, RelationItem>
  defaultFormulasForm: any
}>({
  loading: false,
  submit: false,
  intensity: ['低碳钢', '碳钢', '不锈钢', '铬钢', '铬钒钢', '铬镍钢', '铬钼钢', '铬镍钼钢', '铬锰硅钢', '超高强度钢'],
  intensityVal: [],
  hardness: ['洛氏HRC', '洛氏HRB', '洛氏HRA', '维氏HV', '布氏HBW', '布氏HBS', '布氏HBS(F/D²=10)', '布氏HBS(F/D²=30)'],
  hardnessVal: [],
  relation: {
    碳钢: {
      name: '碳钢',
      unit: 'MPa',
      type: 'intensity',
    },
    不锈钢: {
      name: '不锈钢',
      unit: 'MPa',
      type: 'intensity',
    },
    铬钢: {
      name: '铬钢',
      unit: 'MPa',
      type: 'intensity',
    },
    铬钒钢: {
      name: '铬钒钢',
      unit: 'MPa',
      type: 'intensity',
    },
    铬镍钢: {
      name: '铬镍钢',
      unit: 'MPa',
      type: 'intensity',
    },
    铬钼钢: {
      name: '铬钼钢',
      unit: 'MPa',
      type: 'intensity',
    },
    铬镍钼钢: {
      name: '铬镍钼钢',
      unit: 'MPa',
      type: 'intensity',
    },
    铬锰硅钢: {
      name: '铬锰硅钢',
      unit: 'MPa',
      type: 'intensity',
    },
    超高强度钢: {
      name: '超高强度钢',
      unit: 'MPa',
      type: 'intensity',
    },
    低碳钢: {
      name: '低碳钢',
      unit: 'MPa',
      type: 'intensity',
    },
    洛氏HRC: {
      name: '洛氏',
      unit: 'HRC',
      condition: '',
      type: 'hardness',
    },
    洛氏HRB: {
      name: '洛氏',
      unit: 'HRB',
      condition: '',
      type: 'hardness',
    },
    维氏HV: {
      name: '维氏',
      unit: 'HV',
      condition: '',
      type: 'hardness',
    },
    布氏HBS: {
      name: '布氏',
      unit: 'HBS',
      condition: '',
      type: 'hardness',
    },
    布氏HBW: {
      name: '布氏',
      unit: 'HBW',
      condition: '',
      type: 'hardness',
    },
    洛氏HRA: {
      name: '洛氏',
      unit: 'HRA',
      condition: '',
      type: 'hardness',
    },
    '布氏HBS(F/D²=10)': {
      name: '布氏',
      unit: 'HBS',
      condition: '(F/D²=10)',
      type: 'hardness',
    },
    '布氏HBS(F/D²=30)': {
      name: '布氏',
      unit: 'HBS',
      condition: '(F/D²=30)',
      type: 'hardness',
    },
    表面洛氏HR15N: {
      name: '表面洛氏',
      unit: 'HR15N',
      condition: '',
      type: 'hardness',
    },
    表面洛氏HR30N: {
      name: '表面洛氏',
      unit: 'HR30N',
      condition: '',
      type: 'hardness',
    },
    表面洛氏HR45N: {
      name: '表面洛氏',
      unit: 'HR45N',
      condition: '',
      type: 'hardness',
    },
    表面洛氏HR15T: {
      name: '表面洛氏',
      unit: 'HR15T',
      condition: '',
      type: 'hardness',
    },
    表面洛氏HR30T: {
      name: '表面洛氏',
      unit: 'HR30T',
      condition: '',
      type: 'hardness',
    },
    表面洛氏HR45T: {
      name: '表面洛氏',
      unit: 'HR45T',
      condition: '',
      type: 'hardness',
    },
  } as any,
  defaultFormulasForm: {
    intensity: '',
    intensityVal: '',
    hardness: '',
    hardnessVal: '',
  },
})

// 公式表单
const contrastVaule = ref<any>([
  {
    洛氏HRC: '20',
    洛氏HRA: '60.2',
    表面洛氏HR15N: '68.8',
    表面洛氏HR30N: '40.7',
    表面洛氏HR45N: '19.2',
    维氏HV: '226',
    布氏HBS: '225',
    碳钢: '774',
    不锈钢: '742',
    铬钢: '736',
    铬钒钢: '782',
    铬镍钢: '747',
    铬镍钼钢: '781',
    超高强度钢: '740',
  },
  {
    洛氏HRC: '20.5',
    洛氏HRA: '60.4',
    表面洛氏HR15N: '69',
    表面洛氏HR30N: '41.2',
    表面洛氏HR45N: '19.8',
    维氏HV: '228',
    布氏HBS: '227',
    碳钢: '784',
    不锈钢: '751',
    铬钢: '744',
    铬钒钢: '787',
    铬镍钢: '753',
    铬镍钼钢: '788',
    超高强度钢: '749',
  },
  {
    洛氏HRC: '21',
    洛氏HRA: '60.7',
    表面洛氏HR15N: '69.3',
    表面洛氏HR30N: '41.7',
    表面洛氏HR45N: '20.4',
    维氏HV: '230',
    布氏HBS: '229',
    碳钢: '793',
    不锈钢: '760',
    铬钢: '753',
    铬钒钢: '792',
    铬镍钢: '760',
    铬镍钼钢: '794',
    超高强度钢: '758',
    洛氏HRB: '99.5',
    表面洛氏HR15T: '91.3',
    表面洛氏HR30T: '81.4',
    表面洛氏HR45T: '71.2',
    '布氏HBS(F/D²=30)': '229',
    低碳钢: '778',
  },
  {
    洛氏HRC: '21.5',
    洛氏HRA: '61',
    表面洛氏HR15N: '69.5',
    表面洛氏HR30N: '42.2',
    表面洛氏HR45N: '21',
    维氏HV: '233',
    布氏HBS: '232',
    碳钢: '803',
    不锈钢: '769',
    铬钢: '761',
    铬钒钢: '797',
    铬镍钢: '767',
    铬镍钼钢: '801',
    超高强度钢: '767',
    洛氏HRB: '100',
    表面洛氏HR15T: '91.5',
    表面洛氏HR30T: '81.7',
    表面洛氏HR45T: '71.7',
    '布氏HBS(F/D²=30)': '232',
    低碳钢: '788',
  },
  {
    洛氏HRC: '22',
    洛氏HRA: '61.2',
    表面洛氏HR15N: '69.8',
    表面洛氏HR30N: '42.6',
    表面洛氏HR45N: '21.5',
    维氏HV: '235',
    布氏HBS: '234',
    碳钢: '813',
    不锈钢: '779',
    铬钢: '770',
    铬钒钢: '803',
    铬镍钢: '774',
    铬镍钼钢: '809',
    超高强度钢: '777',
  },
  {
    洛氏HRC: '22.5',
    洛氏HRA: '61.5',
    表面洛氏HR15N: '70',
    表面洛氏HR30N: '43.1',
    表面洛氏HR45N: '22.1',
    维氏HV: '238',
    布氏HBS: '237',
    碳钢: '823',
    不锈钢: '788',
    铬钢: '779',
    铬钒钢: '809',
    铬镍钢: '781',
    铬镍钼钢: '816',
    超高强度钢: '786',
  },
  {
    洛氏HRC: '23',
    洛氏HRA: '61.7',
    表面洛氏HR15N: '70.3',
    表面洛氏HR30N: '43.6',
    表面洛氏HR45N: '22.7',
    维氏HV: '241',
    布氏HBS: '240',
    碳钢: '833',
    不锈钢: '798',
    铬钢: '788',
    铬钒钢: '815',
    铬镍钢: '789',
    铬镍钼钢: '824',
    超高强度钢: '796',
  },
  {
    洛氏HRC: '23.5',
    洛氏HRA: '62',
    表面洛氏HR15N: '70.6',
    表面洛氏HR30N: '44',
    表面洛氏HR45N: '23.3',
    维氏HV: '244',
    布氏HBS: '242',
    碳钢: '843',
    不锈钢: '808',
    铬钢: '797',
    铬钒钢: '822',
    铬镍钢: '797',
    铬镍钼钢: '832',
    超高强度钢: '806',
  },
  {
    洛氏HRC: '24',
    洛氏HRA: '62.2',
    表面洛氏HR15N: '70.8',
    表面洛氏HR30N: '44.5',
    表面洛氏HR45N: '23.9',
    维氏HV: '247',
    布氏HBS: '245',
    碳钢: '854',
    不锈钢: '818',
    铬钢: '807',
    铬钒钢: '829',
    铬镍钢: '805',
    铬镍钼钢: '840',
    超高强度钢: '816',
  },
  {
    洛氏HRC: '24.5',
    洛氏HRA: '62.5',
    表面洛氏HR15N: '71.1',
    表面洛氏HR30N: '45',
    表面洛氏HR45N: '24.5',
    维氏HV: '250',
    布氏HBS: '248',
    碳钢: '864',
    不锈钢: '828',
    铬钢: '816',
    铬钒钢: '836',
    铬镍钢: '813',
    铬镍钼钢: '848',
    超高强度钢: '826',
  },
  {
    洛氏HRC: '25',
    洛氏HRA: '62.8',
    表面洛氏HR15N: '71.4',
    表面洛氏HR30N: '45.5',
    表面洛氏HR45N: '25.1',
    维氏HV: '253',
    布氏HBS: '251',
    碳钢: '875',
    不锈钢: '838',
    铬钢: '826',
    铬钒钢: '843',
    铬镍钢: '822',
    铬镍钼钢: '856',
    超高强度钢: '837',
  },
  {
    洛氏HRC: '25.5',
    洛氏HRA: '63',
    表面洛氏HR15N: '71.6',
    表面洛氏HR30N: '45.9',
    表面洛氏HR45N: '25.7',
    维氏HV: '256',
    布氏HBS: '254',
    碳钢: '886',
    不锈钢: '847',
    铬钢: '848',
    铬钒钢: '837',
    铬镍钢: '851',
    铬钼钢: '831',
    铬镍钼钢: '850',
    铬锰硅钢: '865',
  },
  {
    洛氏HRC: '26',
    洛氏HRA: '63.3',
    表面洛氏HR15N: '71.9',
    表面洛氏HR30N: '46.4',
    表面洛氏HR45N: '26.3',
    维氏HV: '259',
    布氏HBS: '257',
    碳钢: '897',
    不锈钢: '858',
    铬钢: '859',
    铬钒钢: '847',
    铬镍钢: '859',
    铬钼钢: '840',
    铬镍钼钢: '859',
    铬锰硅钢: '874',
  },
  {
    洛氏HRC: '26.5',
    洛氏HRA: '63.5',
    表面洛氏HR15N: '72.2',
    表面洛氏HR30N: '46.9',
    表面洛氏HR45N: '26.9',
    维氏HV: '262',
    布氏HBS: '260',
    碳钢: '908',
    不锈钢: '868',
    铬钢: '870',
    铬钒钢: '858',
    铬镍钢: '867',
    铬钼钢: '850',
    铬镍钼钢: '869',
    铬锰硅钢: '883',
  },
  {
    洛氏HRC: '27',
    洛氏HRA: '63.8',
    表面洛氏HR15N: '72.4',
    表面洛氏HR30N: '47.3',
    表面洛氏HR45N: '27.5',
    维氏HV: '266',
    布氏HBS: '263',
    碳钢: '919',
    不锈钢: '879',
    铬钢: '880',
    铬钒钢: '869',
    铬镍钢: '876',
    铬钼钢: '860',
    铬镍钼钢: '879',
    铬锰硅钢: '893',
  },
  {
    洛氏HRC: '27.5',
    洛氏HRA: '64',
    表面洛氏HR15N: '72.7',
    表面洛氏HR30N: '47.8',
    表面洛氏HR45N: '28.1',
    维氏HV: '269',
    布氏HBS: '266',
    碳钢: '930',
    不锈钢: '890',
    铬钢: '891',
    铬钒钢: '880',
    铬镍钢: '885',
    铬钼钢: '870',
    铬镍钼钢: '890',
    铬锰硅钢: '902',
  },
  {
    洛氏HRC: '28',
    洛氏HRA: '64.3',
    表面洛氏HR15N: '73',
    表面洛氏HR30N: '48.3',
    表面洛氏HR45N: '28.7',
    维氏HV: '273',
    布氏HBS: '269',
    碳钢: '942',
    不锈钢: '901',
    铬钢: '902',
    铬钒钢: '892',
    铬镍钢: '894',
    铬钼钢: '880',
    铬镍钼钢: '901',
    铬锰硅钢: '912',
  },
  {
    洛氏HRC: '28.5',
    洛氏HRA: '64.6',
    表面洛氏HR15N: '73.3',
    表面洛氏HR30N: '48.7',
    表面洛氏HR45N: '29.3',
    维氏HV: '276',
    布氏HBS: '273',
    碳钢: '954',
    不锈钢: '913',
    铬钢: '914',
    铬钒钢: '903',
    铬镍钢: '904',
    铬钼钢: '891',
    铬镍钼钢: '912',
    铬锰硅钢: '922',
  },
  {
    洛氏HRC: '29',
    洛氏HRA: '64.8',
    表面洛氏HR15N: '73.5',
    表面洛氏HR30N: '49.2',
    表面洛氏HR45N: '29.9',
    维氏HV: '280',
    布氏HBS: '276',
    碳钢: '965',
    不锈钢: '924',
    铬钢: '925',
    铬钒钢: '915',
    铬镍钢: '914',
    铬钼钢: '902',
    铬镍钼钢: '923',
    铬锰硅钢: '933',
  },
  {
    洛氏HRC: '29.5',
    洛氏HRA: '65.1',
    表面洛氏HR15N: '73.8',
    表面洛氏HR30N: '49.7',
    表面洛氏HR45N: '30.5',
    维氏HV: '284',
    布氏HBS: '280',
    碳钢: '977',
    不锈钢: '936',
    铬钢: '937',
    铬钒钢: '928',
    铬镍钢: '924',
    铬钼钢: '913',
    铬镍钼钢: '935',
    铬锰硅钢: '943',
  },
  {
    洛氏HRC: '30',
    洛氏HRA: '65.3',
    表面洛氏HR15N: '74.1',
    表面洛氏HR30N: '50.2',
    表面洛氏HR45N: '31.1',
    维氏HV: '288',
    布氏HBS: '283',
    碳钢: '989',
    不锈钢: '947',
    铬钢: '948',
    铬钒钢: '940',
    铬镍钢: '935',
    铬钼钢: '924',
    铬镍钼钢: '947',
    铬锰硅钢: '954',
  },
  {
    洛氏HRC: '30.5',
    洛氏HRA: '65.6',
    表面洛氏HR15N: '74.4',
    表面洛氏HR30N: '50.6',
    表面洛氏HR45N: '31.7',
    维氏HV: '292',
    布氏HBS: '287',
    碳钢: '1002',
    不锈钢: '959',
    铬钢: '960',
    铬钒钢: '953',
    铬镍钢: '946',
    铬钼钢: '936',
    铬镍钼钢: '959',
    铬锰硅钢: '965',
  },
  {
    洛氏HRC: '31',
    洛氏HRA: '65.8',
    表面洛氏HR15N: '74.7',
    表面洛氏HR30N: '51.1',
    表面洛氏HR45N: '32.3',
    维氏HV: '296',
    布氏HBS: '291',
    碳钢: '1014',
    不锈钢: '971',
    铬钢: '972',
    铬钒钢: '966',
    铬镍钢: '957',
    铬钼钢: '948',
    铬镍钼钢: '972',
    铬锰硅钢: '977',
  },
  {
    洛氏HRC: '31.5',
    洛氏HRA: '66.1',
    表面洛氏HR15N: '74.9',
    表面洛氏HR30N: '51.6',
    表面洛氏HR45N: '32.9',
    维氏HV: '300',
    布氏HBS: '294',
    碳钢: '1027',
    不锈钢: '983',
    铬钢: '984',
    铬钒钢: '980',
    铬镍钢: '969',
    铬钼钢: '961',
    铬镍钼钢: '985',
    铬锰硅钢: '989',
  },
  {
    洛氏HRC: '32',
    洛氏HRA: '66.4',
    表面洛氏HR15N: '75.2',
    表面洛氏HR30N: '52',
    表面洛氏HR45N: '33.5',
    维氏HV: '304',
    布氏HBS: '298',
    碳钢: '1039',
    不锈钢: '996',
    铬钢: '996',
    铬钒钢: '993',
    铬镍钢: '981',
    铬钼钢: '974',
    铬镍钼钢: '999',
    铬锰硅钢: '1001',
  },
  {
    洛氏HRC: '32.5',
    洛氏HRA: '66.6',
    表面洛氏HR15N: '75.5',
    表面洛氏HR30N: '52.5',
    表面洛氏HR45N: '34.1',
    维氏HV: '308',
    布氏HBS: '302',
    碳钢: '1052',
    不锈钢: '1008',
    铬钢: '1009',
    铬钒钢: '1007',
    铬镍钢: '994',
    铬钼钢: '987',
    铬镍钼钢: '1012',
    铬锰硅钢: '1013',
  },
  {
    洛氏HRC: '33',
    洛氏HRA: '66.9',
    表面洛氏HR15N: '75.8',
    表面洛氏HR30N: '53',
    表面洛氏HR45N: '34.7',
    维氏HV: '313',
    布氏HBS: '306',
    碳钢: '1065',
    不锈钢: '1021',
    铬钢: '1022',
    铬钒钢: '1022',
    铬镍钢: '1007',
    铬钼钢: '1001',
    铬镍钼钢: '1027',
    铬锰硅钢: '1026',
  },
  {
    洛氏HRC: '33.5',
    洛氏HRA: '67.1',
    表面洛氏HR15N: '76.1',
    表面洛氏HR30N: '53.4',
    表面洛氏HR45N: '35.3',
    维氏HV: '317',
    布氏HBS: '310',
    碳钢: '1078',
    不锈钢: '1034',
    铬钢: '1034',
    铬钒钢: '1036',
    铬镍钢: '1020',
    铬钼钢: '1015',
    铬镍钼钢: '1041',
    铬锰硅钢: '1039',
  },
  {
    洛氏HRC: '34',
    洛氏HRA: '67..4',
    表面洛氏HR15N: '76.4',
    表面洛氏HR30N: '53.9',
    表面洛氏HR45N: '35.9',
    维氏HV: '321',
    布氏HBS: '314',
    碳钢: '1092',
    不锈钢: '1047',
    铬钢: '1048',
    铬钒钢: '1051',
    铬镍钢: '1034',
    铬钼钢: '1029',
    铬镍钼钢: '1056',
    铬锰硅钢: '1052',
  },
  {
    洛氏HRC: '34.5',
    洛氏HRA: '67.7',
    表面洛氏HR15N: '76.7',
    表面洛氏HR30N: '54.4',
    表面洛氏HR45N: '36.5',
    维氏HV: '326',
    布氏HBS: '318',
    碳钢: '1105',
    不锈钢: '1060',
    铬钢: '1061',
    铬钒钢: '1067',
    铬镍钢: '1048',
    铬钼钢: '1043',
    铬镍钼钢: '1071',
    铬锰硅钢: '1066',
  },
  {
    洛氏HRC: '35',
    洛氏HRA: '67.9',
    表面洛氏HR15N: '77',
    表面洛氏HR30N: '54.8',
    表面洛氏HR45N: '37',
    维氏HV: '331',
    布氏HBS: '323',
    碳钢: '1119',
    不锈钢: '1074',
    铬钢: '1074',
    铬钒钢: '1082',
    铬镍钢: '1063',
    铬钼钢: '1058',
    铬镍钼钢: '1087',
    铬锰硅钢: '1079',
  },
  {
    洛氏HRC: '35.5',
    洛氏HRA: '68.2',
    表面洛氏HR15N: '77.2',
    表面洛氏HR30N: '55.3',
    表面洛氏HR45N: '37.6',
    维氏HV: '335',
    布氏HBS: '327',
    碳钢: '1133',
    不锈钢: '1087',
    铬钢: '1088',
    铬钒钢: '1098',
    铬镍钢: '1078',
    铬钼钢: '1074',
    铬镍钼钢: '1103',
    铬锰硅钢: '1094',
  },
  {
    洛氏HRC: '36',
    洛氏HRA: '68.4',
    表面洛氏HR15N: '77.5',
    表面洛氏HR30N: '55.8',
    表面洛氏HR45N: '38.2',
    维氏HV: '340',
    布氏HBS: '332',
    碳钢: '1147',
    不锈钢: '1101',
    铬钢: '1102',
    铬钒钢: '1114',
    铬镍钢: '1093',
    铬钼钢: '1090',
    铬镍钼钢: '1119',
    铬锰硅钢: '1108',
  },
  {
    洛氏HRC: '36.5',
    洛氏HRA: '68.7',
    表面洛氏HR15N: '77.8',
    表面洛氏HR30N: '56.2',
    表面洛氏HR45N: '38.8',
    维氏HV: '345',
    布氏HBS: '336',
    碳钢: '1162',
    不锈钢: '1116',
    铬钢: '1116',
    铬钒钢: '1131',
    铬镍钢: '1109',
    铬钼钢: '1106',
    铬镍钼钢: '1136',
    铬锰硅钢: '1123',
  },
  {
    洛氏HRC: '37',
    洛氏HRA: '69',
    表面洛氏HR15N: '78.1',
    表面洛氏HR30N: '56.7',
    表面洛氏HR45N: '39.4',
    维氏HV: '350',
    布氏HBS: '341',
    碳钢: '1177',
    不锈钢: '1130',
    铬钢: '1131',
    铬钒钢: '1148',
    铬镍钢: '1125',
    铬钼钢: '1122',
    铬镍钼钢: '1153',
    铬锰硅钢: '1139',
  },
  {
    洛氏HRC: '37.5',
    洛氏HRA: '69.2',
    表面洛氏HR15N: '78.4',
    表面洛氏HR30N: '57.2',
    表面洛氏HR45N: '40',
    维氏HV: '355',
    布氏HBS: '345',
    碳钢: '1192',
    不锈钢: '1145',
    铬钢: '1146',
    铬钒钢: '1165',
    铬镍钢: '1142',
    铬钼钢: '1139',
    铬镍钼钢: '1171',
    铬锰硅钢: '1155',
  },
  {
    洛氏HRC: '38',
    洛氏HRA: '69.5',
    表面洛氏HR15N: '78.7',
    表面洛氏HR30N: '57.6',
    表面洛氏HR45N: '40.6',
    维氏HV: '360',
    布氏HBS: '350',
    碳钢: '1207',
    不锈钢: '1161',
    铬钢: '1161',
    铬钒钢: '1183',
    铬镍钢: '1159',
    铬钼钢: '1157',
    铬镍钼钢: '1189',
    铬锰硅钢: '1171',
  },
  {
    洛氏HRC: '38.5',
    洛氏HRA: '69.7',
    表面洛氏HR15N: '79',
    表面洛氏HR30N: '58.1',
    表面洛氏HR45N: '41.2',
    维氏HV: '365',
    布氏HBS: '355',
    碳钢: '1222',
    不锈钢: '1176',
    铬钢: '1176',
    铬钒钢: '1201',
    铬镍钢: '1177',
    铬钼钢: '1174',
    铬镍钼钢: '1207',
    铬锰硅钢: '1187',
    超高强度钢: '1170',
  },
  {
    洛氏HRC: '39',
    洛氏HRA: '70',
    表面洛氏HR15N: '79.3',
    表面洛氏HR30N: '58.6',
    表面洛氏HR45N: '41.8',
    维氏HV: '371',
    布氏HBS: '360',
    碳钢: '1238',
    不锈钢: '1193',
    铬钢: '1192',
    铬钒钢: '1219',
    铬镍钢: '1195',
    铬钼钢: '1192',
    铬镍钼钢: '1226',
    铬锰硅钢: '1204',
    超高强度钢: '1195',
  },
  {
    洛氏HRC: '39.5',
    洛氏HRA: '70.3',
    表面洛氏HR15N: '79.6',
    表面洛氏HR30N: '59',
    表面洛氏HR45N: '42.4',
    维氏HV: '376',
    布氏HBS: '365',
    碳钢: '1254',
    不锈钢: '1209',
    铬钢: '1208',
    铬钒钢: '1238',
    铬镍钢: '1214',
    铬钼钢: '1211',
    铬镍钼钢: '1245',
    铬锰硅钢: '1222',
    超高强度钢: '1219',
  },
  {
    洛氏HRC: '40',
    洛氏HRA: '70.5',
    表面洛氏HR15N: '79.9',
    表面洛氏HR30N: '59.5',
    表面洛氏HR45N: '43',
    维氏HV: '381',
    布氏HBS: '370',
    布氏HBW: '370',
    碳钢: '1271',
    不锈钢: '1226',
    铬钢: '1225',
    铬钒钢: '1257',
    铬镍钢: '1233',
    铬钼钢: '1230',
    铬镍钼钢: '1265',
    铬锰硅钢: '1240',
    超高强度钢: '1243',
  },
  {
    洛氏HRC: '40.5',
    洛氏HRA: '70.8',
    表面洛氏HR15N: '80.2',
    表面洛氏HR30N: '60',
    表面洛氏HR45N: '43.6',
    维氏HV: '387',
    布氏HBS: '375',
    布氏HBW: '375',
    碳钢: '1288',
    不锈钢: '1244',
    铬钢: '1242',
    铬钒钢: '1276',
    铬镍钢: '1252',
    铬钼钢: '1249',
    铬镍钼钢: '1285',
    铬锰硅钢: '1258',
    超高强度钢: '1267',
  },
  {
    洛氏HRC: '41',
    洛氏HRA: '71.1',
    表面洛氏HR15N: '80.5',
    表面洛氏HR30N: '60.4',
    表面洛氏HR45N: '44.2',
    维氏HV: '393',
    布氏HBS: '380',
    布氏HBW: '381',
    碳钢: '1305',
    不锈钢: '1262',
    铬钢: '1260',
    铬钒钢: '1296',
    铬镍钢: '1273',
    铬钼钢: '1269',
    铬镍钼钢: '1306',
    铬锰硅钢: '1277',
    超高强度钢: '1290',
  },
  {
    洛氏HRC: '41.5',
    洛氏HRA: '71.3',
    表面洛氏HR15N: '80.8',
    表面洛氏HR30N: '60.9',
    表面洛氏HR45N: '44.8',
    维氏HV: '398',
    布氏HBS: '385',
    布氏HBW: '386',
    碳钢: '1322',
    不锈钢: '1280',
    铬钢: '1278',
    铬钒钢: '1317',
    铬镍钢: '1293',
    铬钼钢: '1289',
    铬镍钼钢: '1327',
    铬锰硅钢: '1296',
    超高强度钢: '1313',
  },
  {
    洛氏HRC: '42',
    洛氏HRA: '71.6',
    表面洛氏HR15N: '81.1',
    表面洛氏HR30N: '61.3',
    表面洛氏HR45N: '45.4',
    维氏HV: '404',
    布氏HBS: '391',
    布氏HBW: '392',
    碳钢: '1340',
    不锈钢: '1299',
    铬钢: '1296',
    铬钒钢: '1337',
    铬镍钢: '1314',
    铬钼钢: '1310',
    铬镍钼钢: '1348',
    铬锰硅钢: '1316',
    超高强度钢: '1336',
  },
  {
    洛氏HRC: '42.5',
    洛氏HRA: '71.8',
    表面洛氏HR15N: '81.4',
    表面洛氏HR30N: '61.8',
    表面洛氏HR45N: '45.9',
    维氏HV: '410',
    布氏HBS: '396',
    布氏HBW: '397',
    碳钢: '1359',
    不锈钢: '1319',
    铬钢: '1315',
    铬钒钢: '1358',
    铬镍钢: '1336',
    铬钼钢: '1331',
    铬镍钼钢: '1370',
    铬锰硅钢: '1336',
    超高强度钢: '1359',
  },
  {
    洛氏HRC: '43',
    洛氏HRA: '72.1',
    表面洛氏HR15N: '81.7',
    表面洛氏HR30N: '62.3',
    表面洛氏HR45N: '46.5',
    维氏HV: '416',
    布氏HBS: '401',
    布氏HBW: '403',
    碳钢: '1378',
    不锈钢: '1339',
    铬钢: '1335',
    铬钒钢: '1380',
    铬镍钢: '1358',
    铬钼钢: '1353',
    铬镍钼钢: '1392',
    铬锰硅钢: '1357',
    超高强度钢: '1381',
  },
  {
    洛氏HRC: '43.5',
    洛氏HRA: '72.4',
    表面洛氏HR15N: '82',
    表面洛氏HR30N: '62.7',
    表面洛氏HR45N: '47.1',
    维氏HV: '422',
    布氏HBS: '407',
    布氏HBW: '409',
    碳钢: '1397',
    不锈钢: '1361',
    铬钢: '1355',
    铬钒钢: '1401',
    铬镍钢: '1380',
    铬钼钢: '1375',
    铬镍钼钢: '1415',
    铬锰硅钢: '1378',
    超高强度钢: '1404',
  },
  {
    洛氏HRC: '44',
    洛氏HRA: '72.6',
    表面洛氏HR15N: '82.3',
    表面洛氏HR30N: '63.2',
    表面洛氏HR45N: '47.7',
    维氏HV: '428',
    布氏HBS: '413',
    布氏HBW: '415',
    碳钢: '1417',
    不锈钢: '1383',
    铬钢: '1376',
    铬钒钢: '1424',
    铬镍钢: '1404',
    铬钼钢: '1397',
    铬镍钼钢: '1439',
    铬锰硅钢: '1400',
    超高强度钢: '1427',
  },
  {
    洛氏HRC: '44.5',
    洛氏HRA: '72.9',
    表面洛氏HR15N: '82.6',
    表面洛氏HR30N: '63.6',
    表面洛氏HR45N: '48.3',
    维氏HV: '435',
    布氏HBS: '418',
    布氏HBW: '422',
    碳钢: '1438',
    不锈钢: '1405',
    铬钢: '1398',
    铬钒钢: '1446',
    铬镍钢: '1427',
    铬钼钢: '1420',
    铬镍钼钢: '1462',
    铬锰硅钢: '1422',
    超高强度钢: '1450',
  },
  {
    洛氏HRC: '45',
    洛氏HRA: '73.2',
    表面洛氏HR15N: '82.9',
    表面洛氏HR30N: '64.1',
    表面洛氏HR45N: '48.9',
    维氏HV: '441',
    布氏HBS: '424',
    布氏HBW: '428',
    碳钢: '1459',
    不锈钢: '1429',
    铬钢: '1420',
    铬钒钢: '1469',
    铬镍钢: '1451',
    铬钼钢: '1444',
    铬镍钼钢: '1487',
    铬锰硅钢: '1445',
    超高强度钢: '1473',
  },
  {
    洛氏HRC: '45.5',
    洛氏HRA: '73.4',
    表面洛氏HR15N: '83.2',
    表面洛氏HR30N: '64.6',
    表面洛氏HR45N: '49.5',
    维氏HV: '448',
    布氏HBS: '430',
    布氏HBW: '435',
    碳钢: '1481',
    不锈钢: '1453',
    铬钢: '1444',
    铬钒钢: '1493',
    铬镍钢: '1476',
    铬钼钢: '1468',
    铬镍钼钢: '1512',
    铬锰硅钢: '1469',
    超高强度钢: '1496',
  },
  {
    洛氏HRC: '46',
    洛氏HRA: '73.7',
    表面洛氏HR15N: '83.5',
    表面洛氏HR30N: '65',
    表面洛氏HR45N: '50.1',
    维氏HV: '454',
    布氏HBS: '436',
    布氏HBW: '441',
    碳钢: '1503',
    不锈钢: '1479',
    铬钢: '1468',
    铬钒钢: '1517',
    铬镍钢: '1502',
    铬钼钢: '1492',
    铬镍钼钢: '1537',
    铬锰硅钢: '1493',
    超高强度钢: '1520',
  },
  {
    洛氏HRC: '46.5',
    洛氏HRA: '73.9',
    表面洛氏HR15N: '83.7',
    表面洛氏HR30N: '65.5',
    表面洛氏HR45N: '50.7',
    维氏HV: '461',
    布氏HBS: '442',
    布氏HBW: '448',
    碳钢: '1526',
    不锈钢: '1505',
    铬钢: '1493',
    铬钒钢: '1541',
    铬镍钢: '1527',
    铬钼钢: '1517',
    铬镍钼钢: '1563',
    铬锰硅钢: '1517',
    超高强度钢: '1544',
  },
  {
    洛氏HRC: '47',
    洛氏HRA: '74.2',
    表面洛氏HR15N: '84',
    表面洛氏HR30N: '65.9',
    表面洛氏HR45N: '51.2',
    维氏HV: '468',
    布氏HBS: '449',
    布氏HBW: '455',
    碳钢: '1550',
    不锈钢: '1533',
    铬钢: '1519',
    铬钒钢: '1566',
    铬镍钢: '1554',
    铬钼钢: '1542',
    铬镍钼钢: '1589',
    铬锰硅钢: '1543',
    超高强度钢: '1569',
  },
  {
    洛氏HRC: '47.5',
    洛氏HRA: '74.5',
    表面洛氏HR15N: '84.3',
    表面洛氏HR30N: '66.4',
    表面洛氏HR45N: '51.8',
    维氏HV: '475',
    布氏HBW: '463',
    碳钢: '1575',
    不锈钢: '1562',
    铬钢: '1546',
    铬钒钢: '1591',
    铬镍钢: '1581',
    铬钼钢: '1568',
    铬镍钼钢: '1616',
    铬锰硅钢: '1569',
    超高强度钢: '1594',
  },
  {
    洛氏HRC: '48',
    洛氏HRA: '74.7',
    表面洛氏HR15N: '84.6',
    表面洛氏HR30N: '66.8',
    表面洛氏HR45N: '52.4',
    维氏HV: '482',
    布氏HBW: '470',
    碳钢: '1600',
    不锈钢: '1592',
    铬钢: '1574',
    铬钒钢: '1617',
    铬镍钢: '1608',
    铬钼钢: '1595',
    铬镍钼钢: '1643',
    铬锰硅钢: '1595',
    超高强度钢: '1620',
  },
  {
    洛氏HRC: '48.5',
    洛氏HRA: '75',
    表面洛氏HR15N: '84.9',
    表面洛氏HR30N: '67.3',
    表面洛氏HR45N: '53',
    维氏HV: '489',
    布氏HBW: '478',
    碳钢: '1626',
    不锈钢: '1623',
    铬钢: '1603',
    铬钒钢: '1643',
    铬镍钢: '1636',
    铬钼钢: '1622',
    铬镍钼钢: '1671',
    铬锰硅钢: '1623',
    超高强度钢: '1646',
  },
  {
    洛氏HRC: '49',
    洛氏HRA: '75.3',
    表面洛氏HR15N: '85.2',
    表面洛氏HR30N: '67.7',
    表面洛氏HR45N: '53.6',
    维氏HV: '497',
    布氏HBW: '486',
    碳钢: '1653',
    不锈钢: '1655',
    铬钢: '1633',
    铬钒钢: '1670',
    铬镍钢: '1665',
    铬钼钢: '1649',
    铬镍钼钢: '1699',
    铬锰硅钢: '1651',
    超高强度钢: '1674',
  },
  {
    洛氏HRC: '49.5',
    洛氏HRA: '75.5',
    表面洛氏HR15N: '85.5',
    表面洛氏HR30N: '68.2',
    表面洛氏HR45N: '54.2',
    维氏HV: '504',
    布氏HBW: '494',
    碳钢: '1681',
    不锈钢: '1689',
    铬钢: '1665',
    铬钒钢: '1697',
    铬镍钢: '1695',
    铬钼钢: '1677',
    铬镍钼钢: '1728',
    铬锰硅钢: '1679',
    超高强度钢: '1702',
  },
  {
    洛氏HRC: '50',
    洛氏HRA: '75.8',
    表面洛氏HR15N: '85.7',
    表面洛氏HR30N: '68.6',
    表面洛氏HR45N: '54.7',
    维氏HV: '512',
    布氏HBW: '502',
    碳钢: '1710',
    不锈钢: '1725',
    铬钢: '1698',
    铬钒钢: '1724',
    铬镍钢: '1724',
    铬钼钢: '1706',
    铬镍钼钢: '1758',
    铬锰硅钢: '1709',
    超高强度钢: '1731',
  },
  {
    洛氏HRC: '50.5',
    洛氏HRA: '76.1',
    表面洛氏HR15N: '86',
    表面洛氏HR30N: '69.1',
    表面洛氏HR45N: '55.3',
    维氏HV: '520',
    布氏HBW: '510',
    铬钢: '1732',
    铬钒钢: '1752',
    铬镍钢: '1755',
    铬钼钢: '1735',
    铬镍钼钢: '1788',
    铬锰硅钢: '1739',
    超高强度钢: '1761',
  },
  {
    洛氏HRC: '51',
    洛氏HRA: '76.3',
    表面洛氏HR15N: '86.3',
    表面洛氏HR30N: '69.5',
    表面洛氏HR45N: '55.9',
    维氏HV: '527',
    布氏HBW: '518',
    铬钢: '1768',
    铬钒钢: '1780',
    铬镍钢: '1786',
    铬钼钢: '1764',
    铬镍钼钢: '1819',
    铬锰硅钢: '1770',
    超高强度钢: '1792',
  },
  {
    洛氏HRC: '51.5',
    洛氏HRA: '76.6',
    表面洛氏HR15N: '86.6',
    表面洛氏HR30N: '70',
    表面洛氏HR45N: '56.5',
    维氏HV: '535',
    布氏HBW: '527',
    铬钢: '1806',
    铬钒钢: '1809',
    铬镍钢: '1818',
    铬钼钢: '1794',
    铬镍钼钢: '1850',
    铬锰硅钢: '1801',
    超高强度钢: '1824',
  },
  {
    洛氏HRC: '52',
    洛氏HRA: '76.9',
    表面洛氏HR15N: '86.8',
    表面洛氏HR30N: '70.4',
    表面洛氏HR45N: '57.1',
    维氏HV: '544',
    布氏HBW: '535',
    铬钢: '1845',
    铬钒钢: '1839',
    铬镍钢: '1850',
    铬钼钢: '1825',
    铬镍钼钢: '1881',
    铬锰硅钢: '1834',
    超高强度钢: '1857',
  },
  {
    洛氏HRC: '52.5',
    洛氏HRA: '77.1',
    表面洛氏HR15N: '87.1',
    表面洛氏HR30N: '70.9',
    表面洛氏HR45N: '57.6',
    维氏HV: '552',
    布氏HBW: '544',
    铬钒钢: '1869',
    铬镍钢: '1883',
    铬钼钢: '1856',
    铬镍钼钢: '1914',
    铬锰硅钢: '1867',
    超高强度钢: '1892',
  },
  {
    洛氏HRC: '53',
    洛氏HRA: '77.4',
    表面洛氏HR15N: '87.4',
    表面洛氏HR30N: '71.3',
    表面洛氏HR45N: '58.2',
    维氏HV: '561',
    布氏HBW: '552',
    铬钒钢: '1899',
    铬镍钢: '1917',
    铬钼钢: '1888',
    铬镍钼钢: '1947',
    铬锰硅钢: '1901',
    超高强度钢: '1929',
  },
  {
    洛氏HRC: '53.5',
    洛氏HRA: '77.7',
    表面洛氏HR15N: '87.6',
    表面洛氏HR30N: '71.8',
    表面洛氏HR45N: '58.8',
    维氏HV: '569',
    布氏HBW: '561',
    铬钒钢: '1930',
    铬镍钢: '1951',
    铬锰硅钢: '1936',
    超高强度钢: '1966',
  },
  {
    洛氏HRC: '54',
    洛氏HRA: '77.9',
    表面洛氏HR15N: '87.9',
    表面洛氏HR30N: '72.2',
    表面洛氏HR45N: '59.4',
    维氏HV: '578',
    布氏HBW: '569',
    铬钒钢: '1961',
    铬镍钢: '1986',
    铬锰硅钢: '1971',
    超高强度钢: '2006',
  },
  {
    洛氏HRC: '54.5',
    洛氏HRA: '78.2',
    表面洛氏HR15N: '88.1',
    表面洛氏HR30N: '72.6',
    表面洛氏HR45N: '59.9',
    维氏HV: '587',
    布氏HBW: '577',
    铬钒钢: '1993',
    铬镍钢: '2022',
    铬锰硅钢: '2008',
    超高强度钢: '2047',
  },
  {
    洛氏HRC: '55',
    洛氏HRA: '78.5',
    表面洛氏HR15N: '88.4',
    表面洛氏HR30N: '73.1',
    表面洛氏HR45N: '60.5',
    维氏HV: '596',
    布氏HBW: '585',
    铬钒钢: '2026',
    铬镍钢: '2058',
    铬锰硅钢: '2045',
    超高强度钢: '2090',
  },
  {
    洛氏HRC: '55.5',
    洛氏HRA: '78.7',
    表面洛氏HR15N: '88.6',
    表面洛氏HR30N: '73.5',
    表面洛氏HR45N: '61.1',
    维氏HV: '606',
    布氏HBW: '593',
    超高强度钢: '2135',
  },
  {
    洛氏HRC: '56',
    洛氏HRA: '79',
    表面洛氏HR15N: '88.9',
    表面洛氏HR30N: '73.9',
    表面洛氏HR45N: '61.7',
    维氏HV: '615',
    布氏HBW: '601',
    超高强度钢: '2181',
  },
  {
    洛氏HRC: '56.5',
    洛氏HRA: '79.3',
    表面洛氏HR15N: '89.1',
    表面洛氏HR30N: '74.4',
    表面洛氏HR45N: '62.2',
    维氏HV: '625',
    布氏HBW: '608',
    超高强度钢: '2230',
  },
  {
    洛氏HRC: '57',
    洛氏HRA: '79.5',
    表面洛氏HR15N: '89.4',
    表面洛氏HR30N: '74.8',
    表面洛氏HR45N: '62.8',
    维氏HV: '635',
    布氏HBW: '616',
    超高强度钢: '2281',
  },
  {
    洛氏HRC: '57.5',
    洛氏HRA: '79.8',
    表面洛氏HR15N: '89.6',
    表面洛氏HR30N: '75.2',
    表面洛氏HR45N: '63.4',
    维氏HV: '645',
    布氏HBW: '622',
    超高强度钢: '2334',
  },
  {
    洛氏HRC: '58',
    洛氏HRA: '80.1',
    表面洛氏HR15N: '89.8',
    表面洛氏HR30N: '75.6',
    表面洛氏HR45N: '63.9',
    维氏HV: '655',
    布氏HBW: '628',
    超高强度钢: '2390',
  },
  {
    洛氏HRC: '58.5',
    洛氏HRA: '80.3',
    表面洛氏HR15N: '90',
    表面洛氏HR30N: '76.1',
    表面洛氏HR45N: '64.5',
    维氏HV: '666',
    布氏HBW: '634',
    超高强度钢: '2448',
  },
  {
    洛氏HRC: '59',
    洛氏HRA: '80.6',
    表面洛氏HR15N: '90.2',
    表面洛氏HR30N: '76.5',
    表面洛氏HR45N: '65.1',
    维氏HV: '676',
    布氏HBW: '639',
    超高强度钢: '2509',
  },
  {
    洛氏HRC: '59.5',
    洛氏HRA: '80.9',
    表面洛氏HR15N: '90.4',
    表面洛氏HR30N: '76.9',
    表面洛氏HR45N: '65.6',
    维氏HV: '687',
    布氏HBW: '643',
    超高强度钢: '2572',
  },
  {
    洛氏HRC: '60',
    洛氏HRA: '81.2',
    表面洛氏HR15N: '90.6',
    表面洛氏HR30N: '77.3',
    表面洛氏HR45N: '66.2',
    维氏HV: '698',
    布氏HBW: '647',
    超高强度钢: '2639',
  },
  {
    洛氏HRC: '60.5',
    洛氏HRA: '81.4',
    表面洛氏HR15N: '90.8',
    表面洛氏HR30N: '77.7',
    表面洛氏HR45N: '66.8',
    维氏HV: '710',
    布氏HBW: '650',
  },
  {
    洛氏HRC: '61',
    洛氏HRA: '81.7',
    表面洛氏HR15N: '91',
    表面洛氏HR30N: '78.1',
    表面洛氏HR45N: '67.3',
    维氏HV: '721',
  },
  {
    洛氏HRC: '61.5',
    洛氏HRA: '82',
    表面洛氏HR15N: '91.2',
    表面洛氏HR30N: '78.6',
    表面洛氏HR45N: '67.9',
    维氏HV: '733',
  },
  {
    洛氏HRC: '62',
    洛氏HRA: '82.2',
    表面洛氏HR15N: '91.4',
    表面洛氏HR30N: '79',
    表面洛氏HR45N: '68.4',
    维氏HV: '745',
  },
  {
    洛氏HRC: '62.5',
    洛氏HRA: '82.5',
    表面洛氏HR15N: '91.5',
    表面洛氏HR30N: '79.4',
    表面洛氏HR45N: '69',
    维氏HV: '757',
  },
  {
    洛氏HRC: '63',
    洛氏HRA: '82.8',
    表面洛氏HR15N: '91.7',
    表面洛氏HR30N: '79.8',
    表面洛氏HR45N: '69.5',
    维氏HV: '770',
  },
  {
    洛氏HRC: '63.5',
    洛氏HRA: '83.1',
    表面洛氏HR15N: '91.8',
    表面洛氏HR30N: '80.2',
    表面洛氏HR45N: '70.1',
    维氏HV: '782',
  },
  {
    洛氏HRC: '64',
    洛氏HRA: '83.3',
    表面洛氏HR15N: '91.9',
    表面洛氏HR30N: '80.6',
    表面洛氏HR45N: '70.6',
    维氏HV: '795',
  },
  {
    洛氏HRC: '64.5',
    洛氏HRA: '83.6',
    表面洛氏HR15N: '92.1',
    表面洛氏HR30N: '81',
    表面洛氏HR45N: '71.2',
    维氏HV: '809',
  },
  {
    洛氏HRC: '65',
    洛氏HRA: '83.9',
    表面洛氏HR15N: '92.2',
    表面洛氏HR30N: '81.3',
    表面洛氏HR45N: '71.7',
    维氏HV: '822',
  },
  {
    洛氏HRC: '65.5',
    洛氏HRA: '84.1',
    维氏HV: '836',
  },
  {
    洛氏HRC: '66',
    洛氏HRA: '84.4',
    维氏HV: '850',
  },
  {
    洛氏HRC: '66.5',
    洛氏HRA: '84.7',
    维氏HV: '865',
  },
  {
    洛氏HRC: '67',
    洛氏HRA: '85',
    维氏HV: '879',
  },
  {
    洛氏HRC: '67.5',
    洛氏HRA: '85.2',
    维氏HV: '894',
  },
  {
    洛氏HRC: '68',
    洛氏HRA: '85.5',
    维氏HV: '909',
  },
  {
    洛氏HRB: '60',
    表面洛氏HR15T: '80.4',
    表面洛氏HR30T: '56.1',
    表面洛氏HR45T: '30.4',
    维氏HV: '105',
    '布氏HBS(F/D²=10)': '102',
    低碳钢: '375',
  },
  {
    洛氏HRB: '60.5',
    表面洛氏HR15T: '80.5',
    表面洛氏HR30T: '56.4',
    表面洛氏HR45T: '30.9',
    维氏HV: '105',
    '布氏HBS(F/D²=10)': '102',
    低碳钢: '377',
  },
  {
    洛氏HRB: '61',
    表面洛氏HR15T: '80.7',
    表面洛氏HR30T: '56.7',
    表面洛氏HR45T: '31.4',
    维氏HV: '106',
    '布氏HBS(F/D²=10)': '103',
    低碳钢: '379',
  },
  {
    洛氏HRB: '61.5',
    表面洛氏HR15T: '80.8',
    表面洛氏HR30T: '57.1',
    表面洛氏HR45T: '31.9',
    维氏HV: '107',
    '布氏HBS(F/D²=10)': '103',
    低碳钢: '381',
  },
  {
    洛氏HRB: '62',
    表面洛氏HR15T: '80.9',
    表面洛氏HR30T: '57.4',
    表面洛氏HR45T: '32.4',
    维氏HV: '108',
    '布氏HBS(F/D²=10)': '104',
    低碳钢: '382',
  },
  {
    洛氏HRB: '62.5',
    表面洛氏HR15T: '81.1',
    表面洛氏HR30T: '57.7',
    表面洛氏HR45T: '32.9',
    维氏HV: '108',
    '布氏HBS(F/D²=10)': '104',
    低碳钢: '384',
  },
  {
    洛氏HRB: '63',
    表面洛氏HR15T: '81.2',
    表面洛氏HR30T: '58',
    表面洛氏HR45T: '33.5',
    维氏HV: '109',
    '布氏HBS(F/D²=10)': '105',
    低碳钢: '386',
  },
  {
    洛氏HRB: '63.5',
    表面洛氏HR15T: '81.4',
    表面洛氏HR30T: '58.3',
    表面洛氏HR45T: '34',
    维氏HV: '110',
    '布氏HBS(F/D²=10)': '105',
    低碳钢: '388',
  },
  {
    洛氏HRB: '64',
    表面洛氏HR15T: '81.5',
    表面洛氏HR30T: '58.7',
    表面洛氏HR45T: '34.5',
    维氏HV: '110',
    '布氏HBS(F/D²=10)': '106',
    低碳钢: '390',
  },
  {
    洛氏HRB: '64.5',
    表面洛氏HR15T: '81.6',
    表面洛氏HR30T: '59',
    表面洛氏HR45T: '35',
    维氏HV: '111',
    '布氏HBS(F/D²=10)': '106',
    低碳钢: '393',
  },
  {
    洛氏HRB: '65',
    表面洛氏HR15T: '81.8',
    表面洛氏HR30T: '59.3',
    表面洛氏HR45T: '35.5',
    维氏HV: '112',
    '布氏HBS(F/D²=10)': '107',
    低碳钢: '395',
  },
  {
    洛氏HRB: '65.5',
    表面洛氏HR15T: '81.9',
    表面洛氏HR30T: '59.6',
    表面洛氏HR45T: '36.1',
    维氏HV: '113',
    '布氏HBS(F/D²=10)': '107',
    低碳钢: '397',
  },
  {
    洛氏HRB: '66',
    表面洛氏HR15T: '82.1',
    表面洛氏HR30T: '59.9',
    表面洛氏HR45T: '36.6',
    维氏HV: '114',
    '布氏HBS(F/D²=10)': '108',
    低碳钢: '399',
  },
  {
    洛氏HRB: '66.5',
    表面洛氏HR15T: '82.2',
    表面洛氏HR30T: '60.3',
    表面洛氏HR45T: '37.1',
    维氏HV: '115',
    '布氏HBS(F/D²=10)': '108',
    低碳钢: '402',
  },
  {
    洛氏HRB: '67',
    表面洛氏HR15T: '82.3',
    表面洛氏HR30T: '60.6',
    表面洛氏HR45T: '37.6',
    维氏HV: '115',
    '布氏HBS(F/D²=10)': '109',
    低碳钢: '404',
  },
  {
    洛氏HRB: '67.5',
    表面洛氏HR15T: '82.5',
    表面洛氏HR30T: '60.9',
    表面洛氏HR45T: '38.1',
    维氏HV: '116',
    '布氏HBS(F/D²=10)': '110',
    低碳钢: '407',
  },
  {
    洛氏HRB: '68',
    表面洛氏HR15T: '82.6',
    表面洛氏HR30T: '61.2',
    表面洛氏HR45T: '38.6',
    维氏HV: '117',
    '布氏HBS(F/D²=10)': '110',
    低碳钢: '409',
  },
  {
    洛氏HRB: '68.5',
    表面洛氏HR15T: '82.7',
    表面洛氏HR30T: '61.5',
    表面洛氏HR45T: '39.2',
    维氏HV: '118',
    '布氏HBS(F/D²=10)': '111',
    低碳钢: '412',
  },
  {
    洛氏HRB: '69',
    表面洛氏HR15T: '82.9',
    表面洛氏HR30T: '61.9',
    表面洛氏HR45T: '39.7',
    维氏HV: '119',
    '布氏HBS(F/D²=10)': '112',
    低碳钢: '415',
  },
  {
    洛氏HRB: '69.5',
    表面洛氏HR15T: '83',
    表面洛氏HR30T: '62.2',
    表面洛氏HR45T: '40.2',
    维氏HV: '120',
    '布氏HBS(F/D²=10)': '112',
    低碳钢: '418',
  },
  {
    洛氏HRB: '70',
    表面洛氏HR15T: '83.2',
    表面洛氏HR30T: '62.5',
    表面洛氏HR45T: '40.7',
    维氏HV: '121',
    '布氏HBS(F/D²=10)': '113',
    低碳钢: '421',
  },
  {
    洛氏HRB: '70.5',
    表面洛氏HR15T: '83.3',
    表面洛氏HR30T: '62.8',
    表面洛氏HR45T: '41.2',
    维氏HV: '122',
    '布氏HBS(F/D²=10)': '114',
    低碳钢: '424',
  },
  {
    洛氏HRB: '71',
    表面洛氏HR15T: '83.4',
    表面洛氏HR30T: '63.1',
    表面洛氏HR45T: '41.7',
    维氏HV: '123',
    '布氏HBS(F/D²=10)': '115',
    低碳钢: '427',
  },
  {
    洛氏HRB: '71.5',
    表面洛氏HR15T: '83.6',
    表面洛氏HR30T: '63.5',
    表面洛氏HR45T: '42.3',
    维氏HV: '124',
    '布氏HBS(F/D²=10)': '115',
    低碳钢: '430',
  },
  {
    洛氏HRB: '72',
    表面洛氏HR15T: '83.7',
    表面洛氏HR30T: '63.8',
    表面洛氏HR45T: '42.8',
    维氏HV: '125',
    '布氏HBS(F/D²=10)': '116',
    低碳钢: '433',
  },
  {
    洛氏HRB: '72.5',
    表面洛氏HR15T: '83.9',
    表面洛氏HR30T: '64.1',
    表面洛氏HR45T: '43.3',
    维氏HV: '126',
    '布氏HBS(F/D²=10)': '117',
    低碳钢: '437',
  },
  {
    洛氏HRB: '73',
    表面洛氏HR15T: '84',
    表面洛氏HR30T: '64.4',
    表面洛氏HR45T: '43.8',
    维氏HV: '128',
    '布氏HBS(F/D²=10)': '118',
    低碳钢: '440',
  },
  {
    洛氏HRB: '73.5',
    表面洛氏HR15T: '84.1',
    表面洛氏HR30T: '64.7',
    表面洛氏HR45T: '44.3',
    维氏HV: '129',
    '布氏HBS(F/D²=10)': '119',
    低碳钢: '444',
  },
  {
    洛氏HRB: '74',
    表面洛氏HR15T: '84.3',
    表面洛氏HR30T: '65.1',
    表面洛氏HR45T: '44.8',
    维氏HV: '130',
    '布氏HBS(F/D²=10)': '120',
    低碳钢: '447',
  },
  {
    洛氏HRB: '74.5',
    表面洛氏HR15T: '84.4',
    表面洛氏HR30T: '65.4',
    表面洛氏HR45T: '45.4',
    维氏HV: '131',
    '布氏HBS(F/D²=10)': '121',
    低碳钢: '451',
  },
  {
    洛氏HRB: '75',
    表面洛氏HR15T: '84.5',
    表面洛氏HR30T: '65.7',
    表面洛氏HR45T: '45.9',
    维氏HV: '132',
    '布氏HBS(F/D²=10)': '122',
    低碳钢: '455',
  },
  {
    洛氏HRB: '75.5',
    表面洛氏HR15T: '84.7',
    表面洛氏HR30T: '66',
    表面洛氏HR45T: '46.4',
    维氏HV: '134',
    '布氏HBS(F/D²=10)': '123',
    低碳钢: '459',
  },
  {
    洛氏HRB: '76',
    表面洛氏HR15T: '84.8',
    表面洛氏HR30T: '66.3',
    表面洛氏HR45T: '46.9',
    维氏HV: '135',
    '布氏HBS(F/D²=10)': '124',
    低碳钢: '463',
  },
  {
    洛氏HRB: '76.5',
    表面洛氏HR15T: '85',
    表面洛氏HR30T: '66.6',
    表面洛氏HR45T: '47.4',
    维氏HV: '136',
    '布氏HBS(F/D²=10)': '125',
    低碳钢: '467',
  },
  {
    洛氏HRB: '77',
    表面洛氏HR15T: '85.1',
    表面洛氏HR30T: '67',
    表面洛氏HR45T: '47.9',
    维氏HV: '138',
    '布氏HBS(F/D²=10)': '126',
    低碳钢: '471',
  },
  {
    洛氏HRB: '77.5',
    表面洛氏HR15T: '85.2',
    表面洛氏HR30T: '67.3',
    表面洛氏HR45T: '48.5',
    维氏HV: '139',
    '布氏HBS(F/D²=10)': '127',
    低碳钢: '475',
  },
  {
    洛氏HRB: '78',
    表面洛氏HR15T: '85.4',
    表面洛氏HR30T: '67.6',
    表面洛氏HR45T: '49',
    维氏HV: '140',
    '布氏HBS(F/D²=10)': '128',
    低碳钢: '480',
  },
  {
    洛氏HRB: '78.5',
    表面洛氏HR15T: '85.5',
    表面洛氏HR30T: '67.9',
    表面洛氏HR45T: '49.5',
    维氏HV: '142',
    '布氏HBS(F/D²=10)': '129',
    低碳钢: '484',
  },
  {
    洛氏HRB: '79',
    表面洛氏HR15T: '85.7',
    表面洛氏HR30T: '68.2',
    表面洛氏HR45T: '50',
    维氏HV: '143',
    '布氏HBS(F/D²=10)': '130',
    低碳钢: '489',
  },
  {
    洛氏HRB: '79.5',
    表面洛氏HR15T: '85.8',
    表面洛氏HR30T: '68.6',
    表面洛氏HR45T: '50.5',
    维氏HV: '145',
    '布氏HBS(F/D²=10)': '132',
    低碳钢: '493',
  },
  {
    洛氏HRB: '80',
    表面洛氏HR15T: '85.9',
    表面洛氏HR30T: '68.9',
    表面洛氏HR45T: '51',
    维氏HV: '146',
    '布氏HBS(F/D²=10)': '133',
    低碳钢: '498',
  },
  {
    洛氏HRB: '80.5',
    表面洛氏HR15T: '86.1',
    表面洛氏HR30T: '69.2',
    表面洛氏HR45T: '51.6',
    维氏HV: '148',
    '布氏HBS(F/D²=10)': '134',
    低碳钢: '503',
  },
  {
    洛氏HRB: '81',
    表面洛氏HR15T: '86.2',
    表面洛氏HR30T: '69.5',
    表面洛氏HR45T: '52.1',
    维氏HV: '149',
    '布氏HBS(F/D²=10)': '136',
    低碳钢: '508',
  },
  {
    洛氏HRB: '81.5',
    表面洛氏HR15T: '86.3',
    表面洛氏HR30T: '69.8',
    表面洛氏HR45T: '52.6',
    维氏HV: '151',
    '布氏HBS(F/D²=10)': '137',
    低碳钢: '513',
  },
  {
    洛氏HRB: '82',
    表面洛氏HR15T: '86.5',
    表面洛氏HR30T: '70.2',
    表面洛氏HR45T: '53.1',
    维氏HV: '152',
    '布氏HBS(F/D²=10)': '138',
    低碳钢: '518',
  },
  {
    洛氏HRB: '82.5',
    表面洛氏HR15T: '86.6',
    表面洛氏HR30T: '70.5',
    表面洛氏HR45T: '53.6',
    维氏HV: '154',
    '布氏HBS(F/D²=10)': '140',
    低碳钢: '523',
  },
  {
    洛氏HRB: '83',
    表面洛氏HR15T: '86.8',
    表面洛氏HR30T: '70.8',
    表面洛氏HR45T: '54.1',
    维氏HV: '156',
    '布氏HBS(F/D²=30)': '152',
    低碳钢: '529',
  },
  {
    洛氏HRB: '83.5',
    表面洛氏HR15T: '86.9',
    表面洛氏HR30T: '71.1',
    表面洛氏HR45T: '54.7',
    维氏HV: '157',
    '布氏HBS(F/D²=30)': '154',
    低碳钢: '534',
  },
  {
    洛氏HRB: '84',
    表面洛氏HR15T: '87',
    表面洛氏HR30T: '71.4',
    表面洛氏HR45T: '55.2',
    维氏HV: '159',
    '布氏HBS(F/D²=30)': '155',
    低碳钢: '540',
  },
  {
    洛氏HRB: '84.5',
    表面洛氏HR15T: '87.2',
    表面洛氏HR30T: '71.8',
    表面洛氏HR45T: '55.7',
    维氏HV: '161',
    '布氏HBS(F/D²=30)': '156',
    低碳钢: '546',
  },
  {
    洛氏HRB: '85',
    表面洛氏HR15T: '87.3',
    表面洛氏HR30T: '72.1',
    表面洛氏HR45T: '56.2',
    维氏HV: '163',
    '布氏HBS(F/D²=30)': '158',
    低碳钢: '551',
  },
  {
    洛氏HRB: '85.5',
    表面洛氏HR15T: '87.5',
    表面洛氏HR30T: '72.4',
    表面洛氏HR45T: '56.7',
    维氏HV: '165',
    '布氏HBS(F/D²=30)': '159',
    低碳钢: '557',
  },
  {
    洛氏HRB: '86',
    表面洛氏HR15T: '87.6',
    表面洛氏HR30T: '72.7',
    表面洛氏HR45T: '57.2',
    维氏HV: '166',
    '布氏HBS(F/D²=30)': '161',
    低碳钢: '563',
  },
  {
    洛氏HRB: '86.5',
    表面洛氏HR15T: '87.7',
    表面洛氏HR30T: '73',
    表面洛氏HR45T: '57.8',
    维氏HV: '168',
    '布氏HBS(F/D²=30)': '163',
    低碳钢: '570',
  },
  {
    洛氏HRB: '87',
    表面洛氏HR15T: '87.9',
    表面洛氏HR30T: '73.4',
    表面洛氏HR45T: '58.3',
    维氏HV: '170',
    '布氏HBS(F/D²=30)': '164',
    低碳钢: '576',
  },
  {
    洛氏HRB: '87.5',
    表面洛氏HR15T: '88',
    表面洛氏HR30T: '73.7',
    表面洛氏HR45T: '58.8',
    维氏HV: '172',
    '布氏HBS(F/D²=30)': '166',
    低碳钢: '582',
  },
  {
    洛氏HRB: '88',
    表面洛氏HR15T: '88.1',
    表面洛氏HR30T: '74',
    表面洛氏HR45T: '59.3',
    维氏HV: '174',
    '布氏HBS(F/D²=30)': '168',
    低碳钢: '589',
  },
  {
    洛氏HRB: '88.5',
    表面洛氏HR15T: '88.3',
    表面洛氏HR30T: '74.3',
    表面洛氏HR45T: '59.8',
    维氏HV: '176',
    '布氏HBS(F/D²=30)': '170',
    低碳钢: '596',
  },
  {
    洛氏HRB: '89',
    表面洛氏HR15T: '88.4',
    表面洛氏HR30T: '74.6',
    表面洛氏HR45T: '60.3',
    维氏HV: '178',
    '布氏HBS(F/D²=30)': '172',
    低碳钢: '603',
  },
  {
    洛氏HRB: '89.5',
    表面洛氏HR15T: '88.6',
    表面洛氏HR30T: '75',
    表面洛氏HR45T: '60.9',
    维氏HV: '180',
    '布氏HBS(F/D²=30)': '174',
    低碳钢: '609',
  },
  {
    洛氏HRB: '90',
    表面洛氏HR15T: '88.7',
    表面洛氏HR30T: '75.3',
    表面洛氏HR45T: '61.4',
    维氏HV: '183',
    '布氏HBS(F/D²=30)': '176',
    低碳钢: '617',
  },
  {
    洛氏HRB: '90.5',
    表面洛氏HR15T: '88.8',
    表面洛氏HR30T: '75.6',
    表面洛氏HR45T: '61.9',
    维氏HV: '185',
    '布氏HBS(F/D²=30)': '178',
    低碳钢: '624',
  },
  {
    洛氏HRB: '91',
    表面洛氏HR15T: '89',
    表面洛氏HR30T: '75.9',
    表面洛氏HR45T: '62.4',
    维氏HV: '187',
    '布氏HBS(F/D²=30)': '180',
    低碳钢: '631',
  },
  {
    洛氏HRB: '91.5',
    表面洛氏HR15T: '89.1',
    表面洛氏HR30T: '76.2',
    表面洛氏HR45T: '62.9',
    维氏HV: '189',
    '布氏HBS(F/D²=30)': '182',
    低碳钢: '639',
  },
  {
    洛氏HRB: '92',
    表面洛氏HR15T: '89.3',
    表面洛氏HR30T: '76.6',
    表面洛氏HR45T: '63.4',
    维氏HV: '191',
    '布氏HBS(F/D²=30)': '184',
    低碳钢: '646',
  },
  {
    洛氏HRB: '92.5',
    表面洛氏HR15T: '89.4',
    表面洛氏HR30T: '76.9',
    表面洛氏HR45T: '64',
    维氏HV: '194',
    '布氏HBS(F/D²=30)': '187',
    低碳钢: '654',
  },
  {
    洛氏HRB: '93',
    表面洛氏HR15T: '89.5',
    表面洛氏HR30T: '77.2',
    表面洛氏HR45T: '64.5',
    维氏HV: '196',
    '布氏HBS(F/D²=30)': '189',
    低碳钢: '662',
  },
  {
    洛氏HRB: '93.5',
    表面洛氏HR15T: '89.7',
    表面洛氏HR30T: '77.5',
    表面洛氏HR45T: '65',
    维氏HV: '199',
    '布氏HBS(F/D²=30)': '192',
    低碳钢: '670',
  },
  {
    洛氏HRB: '94',
    表面洛氏HR15T: '89.8',
    表面洛氏HR30T: '77.8',
    表面洛氏HR45T: '65.5',
    维氏HV: '201',
    '布氏HBS(F/D²=30)': '195',
    低碳钢: '678',
  },
  {
    洛氏HRB: '94.5',
    表面洛氏HR15T: '89.9',
    表面洛氏HR30T: '78.2',
    表面洛氏HR45T: '66',
    维氏HV: '203',
    '布氏HBS(F/D²=30)': '197',
    低碳钢: '686',
  },
  {
    洛氏HRB: '95',
    表面洛氏HR15T: '90.1',
    表面洛氏HR30T: '78.5',
    表面洛氏HR45T: '66.5',
    维氏HV: '206',
    '布氏HBS(F/D²=30)': '200',
    低碳钢: '695',
  },
  {
    洛氏HRB: '95.5',
    表面洛氏HR15T: '90.2',
    表面洛氏HR30T: '78.8',
    表面洛氏HR45T: '67.1',
    维氏HV: '208',
    '布氏HBS(F/D²=30)': '203',
    低碳钢: '703',
  },
  {
    洛氏HRB: '96',
    表面洛氏HR15T: '90.4',
    表面洛氏HR30T: '79.1',
    表面洛氏HR45T: '67.6',
    维氏HV: '211',
    '布氏HBS(F/D²=30)': '206',
    低碳钢: '712',
  },
  {
    洛氏HRB: '96.5',
    表面洛氏HR15T: '90.5',
    表面洛氏HR30T: '79.4',
    表面洛氏HR45T: '68.1',
    维氏HV: '214',
    '布氏HBS(F/D²=30)': '209',
    低碳钢: '721',
  },
  {
    洛氏HRB: '97',
    表面洛氏HR15T: '90.6',
    表面洛氏HR30T: '79.8',
    表面洛氏HR45T: '68.6',
    维氏HV: '216',
    '布氏HBS(F/D²=30)': '212',
    低碳钢: '730',
  },
  {
    洛氏HRB: '97.5',
    表面洛氏HR15T: '90.8',
    表面洛氏HR30T: '80.1',
    表面洛氏HR45T: '69.1',
    维氏HV: '219',
    '布氏HBS(F/D²=30)': '215',
    低碳钢: '739',
  },
  {
    洛氏HRB: '98',
    表面洛氏HR15T: '90.9',
    表面洛氏HR30T: '80.4',
    表面洛氏HR45T: '69.6',
    维氏HV: '222',
    '布氏HBS(F/D²=30)': '218',
    低碳钢: '749',
  },
  {
    洛氏HRB: '98.5',
    表面洛氏HR15T: '91.1',
    表面洛氏HR30T: '80.7',
    表面洛氏HR45T: '70.2',
    维氏HV: '225',
    '布氏HBS(F/D²=30)': '222',
    低碳钢: '758',
  },
  {
    洛氏HRB: '99',
    表面洛氏HR15T: '91.2',
    表面洛氏HR30T: '81',
    表面洛氏HR45T: '70.7',
    维氏HV: '227',
    '布氏HBS(F/D²=30)': '226',
    低碳钢: '768',
  },
])

const formulasForm = ref<any>(JSON.parse(JSON.stringify(state.defaultFormulasForm)))
const metric = ref(props.currentFormula?.unit || 'MPa')
const result = ref<any>({})

const filteredRelation = (filter: string) => {
  // return Object.entries(state.relation)
  //   .filter(([_, value]) => (value as RelationItem).type === filter) // 使用类型断言
  //   .map(([key, value]) => value);

  return Object.entries(state.relation).reduce((acc: Record<string, any>, [key, value]) => {
    if (value.type === filter) {
      acc[key] = value
    }
    return acc
  }, {})
}

const changeIntensity = () => {
  state.intensityVal = contrastVaule.value
    .filter((item: any) => item[formulasForm.value.intensity])
    .map((item: any) => {
      return {
        value: item[formulasForm.value.intensity],
      }
    })
  formulasForm.value.intensityVal = ''
  result.value = {}
  // console.log('changeIntensity:', formulasForm.value.intensity, JSON.stringify(state.intensityVal));
}

const querySearchIntensity = (queryString: string, cb: any) => {
  const createFilter = (queryString: string) => {
    return (restaurant: any) => {
      return restaurant.value.toLowerCase().indexOf(queryString.toLowerCase()) === 0
    }
  }
  const results = queryString ? state.intensityVal.filter(createFilter(queryString)) : state.intensityVal
  // call callback function to return suggestions
  cb(results)
}

const changeHardness = () => {
  state.hardnessVal = contrastVaule.value
    .filter((item: any) => item[formulasForm.value.hardness])
    .map((item: any) => {
      return {
        value: item[formulasForm.value.hardness],
      }
    })
  formulasForm.value.hardnessVal = ''
  result.value = {}
  // console.log('changeHardness:', formulasForm.value.hardness, JSON.stringify(state.hardnessVal));
}

const querySearchHardness = (queryString: string, cb: any) => {
  const createFilter = (queryString: string) => {
    return (restaurant: any) => {
      return restaurant.value.toLowerCase().indexOf(queryString.toLowerCase()) === 0
    }
  }
  const results = queryString ? state.hardnessVal.filter(createFilter(queryString)) : state.hardnessVal
  // call callback function to return suggestions
  cb(results)
}

// 复制
const handleCopy = (val: any, text: any) => {
  clip(val, text)
}
const changeUnit = (value: any, index: string) => {
  // 1MPa = 145.037737ksi
  const ksiFactor = 145.037737
  if (result.value[index]) {
    if (value == 'ksi') {
      result.value[index] = result.value[index] / ksiFactor
    } else if (value == 'MPa') {
      result.value[index] = result.value[index] * ksiFactor
    }
  }
}

// 计算全部公式
const changeResult = (queryKey: string, queryValue: string) => {
  if (state.submit) return
  state.submit = true
  result.value = {}
  try {
    function findRowByCarbonSteel() {
      for (let i = 0; i < contrastVaule.value.length; i++) {
        if (contrastVaule.value[i][queryKey] && contrastVaule.value[i][queryKey] === queryValue) {
          return contrastVaule.value[i]
        }
      }
      return null
    }
    result.value = findRowByCarbonSteel()
  } catch (e) {
    console.log(`固定公式[${props.currentFormula.code}]:`, e, props.currentFormula?.columnar)
  } finally {
    state.submit = false
  }
}

const handleIntensity = () => {
  changeResult(formulasForm.value.intensity, formulasForm.value.intensityVal)
}

const handleHardness = () => {
  changeResult(formulasForm.value.hardness, formulasForm.value.hardnessVal)
}

const closeFormula = () => {
  emit('close')
}

const handelDefault = () => {}

// 暴露组件方法给父组件
defineExpose({ handelDefault })

// const dataString = ``;
// const rows = dataString.trim().split('\n').map(row => row.split('\t'));
// const headers = rows[0];

// const jsonData = rows.slice(1).map(row => {
//   const obj = {};
//   for (let i = 0; i < headers.length; i++) {
//     if (row[i] && row[i] !== "-") obj[headers[i]] = row[i];
//   }
//   return obj;
// });
// console.log(JSON.stringify(jsonData))
</script>

<style>
.intensity-header {
  background: rgba(11, 80, 37, 0.3) !important;
}

.intensity-focal-header {
  background: rgba(11, 80, 37, 0.6) !important;
}

.hardness-header {
  background-color: rgba(255, 0, 0, 0.3) !important;
}

.hardness-focal-header {
  background-color: rgba(255, 0, 0, 0.6) !important;
}
</style>
